# Core development tools
brew "zsh"
brew "tmux"
brew "neovim"
brew "git"
brew "gnupg"
brew "curl"
brew "wget"

# Modern CLI tools
brew "starship"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "glow"
brew "zoxide"
brew "chezmoi"
brew "lazygit"

# Zsh plugins
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"

# Language support
brew "node"
brew "python3"
brew "go"
brew "rust"

# Terminal and fonts
cask "ghostty"
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"

# Optional but useful
brew "htop"
brew "tree"
brew "jq"
brew "gh"